#!/usr/bin/env python3
"""
Комплексный тест для проверки корректности обработки эмодзи в PDF.

Этот скрипт тестирует:
1. Эмодзи с variation selectors (❤️, ⭐️, ✅)
2. Составные эмодзи (флаги, skin tones)
3. Множественные эмодзи подряд
4. Эмодзи в тексте постов
5. Эмодзи в названии канала
"""

import os
from datetime import datetime
from pdf_builder import create_pdf
from emoji_handler import normalize_emoji_text, format_reactions_list


def test_emoji_normalization():
    """
    Тест нормализации эмодзи (unit test).
    """
    print("=" * 60)
    print("ТЕСТ 1: Нормализация эмодзи")
    print("=" * 60)

    test_cases = [
        # (input, expected_output, description)
        ("❤️", "❤️", "Эмодзи с variation selector"),
        ("❤️❤️", "❤️", "Дублирующиеся variation selectors"),
        ("текст\u200B\u200C", "текст", "Невидимые символы"),
        ("🏳️‍🌈", "🏳️‍🌈", "Составное эмодзи (флаг радуги)"),
        ("👨‍👩‍👧‍👦", "👨‍👩‍👧‍👦", "Составное эмодзи (семья)"),
    ]

    passed = 0
    failed = 0

    for input_text, expected, description in test_cases:
        result = normalize_emoji_text(input_text)
        status = "✅ PASS" if result == expected else "❌ FAIL"

        if result == expected:
            passed += 1
        else:
            failed += 1

        print(f"{status} | {description}")
        if result != expected:
            print(f"  Ожидалось: {repr(expected)}")
            print(f"  Получено:  {repr(result)}")

    print(f"\nРезультаты: {passed} успешно, {failed} провалено\n")


def test_reactions_formatting():
    """
    Тест форматирования реакций (unit test).
    """
    print("=" * 60)
    print("ТЕСТ 2: Форматирование реакций")
    print("=" * 60)

    reactions = [
        {"emoji": "❤️", "count": 59},
        {"emoji": "👍", "count": 33},
        {"emoji": "🔥", "count": 12},
    ]

    result = format_reactions_list(reactions)
    print(f"Входные данные: {reactions}")
    print(f"Результат: {result}")
    print(f"Проверка неразрывных пробелов: {chr(0x00A0) in result}")
    print()


def test_pdf_generation():
    """
    Тест генерации PDF с различными эмодзи (integration test).
    """
    print("=" * 60)
    print("ТЕСТ 3: Генерация PDF с эмодзи")
    print("=" * 60)

    # Создаём временную папку для результатов
    tmp_dir = "./tmp"
    os.makedirs(tmp_dir, exist_ok=True)

    # Комплексные тестовые данные
    test_posts = [
        {
            "date": datetime(2025, 7, 18),
            "text": "🦟 Пост с эмодзи комара в начале текста.\n\n❤️ И сердцем на новой строке.\n\n🔥 Огонь тоже должен быть виден.",
            "views": 2739,
            "reactions": [
                {"emoji": "🦟", "count": 1},
                {"emoji": "❤️", "count": 59},
                {"emoji": "👍", "count": 33},
                {"emoji": "🔥", "count": 12},
            ]
        },
        {
            "date": datetime(2025, 7, 19),
            "text": "Пост с эмодзи во всех реакциях: 😂🎉💯👏🚀",
            "views": 1500,
            "reactions": [
                {"emoji": "😂", "count": 45},
                {"emoji": "❤️", "count": 30},
                {"emoji": "🎉", "count": 20},
                {"emoji": "💯", "count": 15},
                {"emoji": "👏", "count": 10},
                {"emoji": "🚀", "count": 5},
            ]
        },
        {
            "date": datetime(2025, 7, 20),
            "text": "Проверка составных эмодзи:\n🏳️‍🌈 Флаг радуги\n👨‍👩‍👧‍👦 Семья\n👍🏻 Палец вверх (светлая кожа)",
            "views": 890,
            "reactions": [
                {"emoji": "❤️", "count": 100},
                {"emoji": "⭐", "count": 50},
                {"emoji": "✅", "count": 25},
                {"emoji": "🙏", "count": 15},
            ]
        },
        {
            "date": datetime(2025, 7, 21),
            "text": "Тест эмодзи с variation selectors:\n❤️ Сердце\n⭐️ Звезда\n✅ Галочка",
            "views": 543,
            "reactions": [
                {"emoji": "❤️", "count": 200},
                {"emoji": "⭐️", "count": 150},
                {"emoji": "✅", "count": 100},
            ]
        }
    ]

    # Генерируем PDF с эмодзи в названии канала
    output_file = os.path.join(tmp_dir, "emoji_comprehensive_test.pdf")
    channel_name = "📱 Тестовый канал с эмодзи ❤️"

    print(f"Генерирую PDF: {output_file}")
    pdf_path = create_pdf(test_posts, output_file, channel_name)

    print(f"✅ PDF создан: {pdf_path}\n")

    return pdf_path


def main():
    """
    Главная функция - запускает все тесты.
    """
    print("\n" + "=" * 60)
    print("КОМПЛЕКСНЫЙ ТЕСТ ОБРАБОТКИ ЭМОДЗИ В PDF")
    print("=" * 60 + "\n")

    # Unit tests
    test_emoji_normalization()
    test_reactions_formatting()

    # Integration test
    pdf_path = test_pdf_generation()

    # Финальные инструкции
    print("=" * 60)
    print("ПРОВЕРКА РЕЗУЛЬТАТОВ")
    print("=" * 60)
    print(f"\n📄 Откройте файл: {pdf_path}")
    print("\n✅ Проверьте следующее:")
    print("   1. Все эмодзи отображаются корректно (нет артефактов)")
    print("   2. Нет 'серых ушек' или наложений над/перед ❤️")
    print("   3. Каждое эмодзи отображается ровно один раз")
    print("   4. Составные эмодзи (🏳️‍🌈, 👨‍👩‍👧‍👦) отображаются правильно")
    print("   5. Эмодзи в названии канала отображаются корректно")
    print("   6. Выравнивание и пробелы между эмодзи и цифрами нормальные")
    print("\n" + "=" * 60 + "\n")


if __name__ == "__main__":
    main()
